app/views/messages/index.html.erb

        <td><%= message.message %></td>
        <td><%=l message.created_at %></td>
---
INSERT INTO "messages" ("created_at", "message", "recipient", "sender", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-07-01 19:55:15.221103"], ["message", "hallo"], ["recipient", "test10"], ["sender", "test10"], ["updated_at", "2015-07-01 19:55:15.221103"]]