app/controllers/messages_controller.rb

  def index
    fetchMessages
    #@messages = Message.all
    @messages = Message.where(recipient: current_user.name)
---
SELECT  "messages".* FROM "messages"  WHERE "messages"."recipient" = 2 LIMIT 1