app/controllers/users_controller.rb

        puts "============================================"
        puts "User created"
        puts "============================================"
        if @user.save
---
INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-05-16 13:46:25.213530"], ["name", "1234"], ["password_digest", "$2a$10$wRJFhqUuIs38XGzgtFeDOejGaXx4wVLjggpdk6dZEKTQ8x01hbZQS"], ["updated_at", "2015-05-16 13:46:25.213530"]]

  def destroy
    respond_to do |format|
      response = HTTParty.delete("http://#{WebClient::Application::SERVER_IP}/#{@user.name}")
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]